; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-2-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p1-2 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s0)
	(at driver4 s1)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at package1 s1)
	(at package2 s2)
	(at package3 s1)
	(at package4 s1)
	(at package5 s0)
	(at package6 s1)
	(at package7 s2)
	(at package8 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 62)
	(= (time-to-walk p0-1 s0) 62)
	(= (time-to-walk s1 p0-1) 15)
	(= (time-to-walk p0-1 s1) 15)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 90)
	(= (time-to-walk p1-2 s1) 90)
	(= (time-to-walk s2 p1-2) 94)
	(= (time-to-walk p1-2 s2) 94)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 93)
	(= (time-to-walk p2-0 s2) 93)
	(= (time-to-walk s0 p2-0) 65)
	(= (time-to-walk p2-0 s0) 65)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 66)
	(= (time-to-drive s2 s1) 66)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 60)
	(= (time-to-drive s0 s2) 60)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s2)
	(at truck1 s1)
	(at truck2 s2)
	(at package2 s1)
	(at package3 s1)
	(at package4 s2)
	(at package5 s2)
	(at package6 s0)
	(at package7 s1)
	(at package8 s0)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (walk driver3 s0 p2-0)
   deleted: (at driver3 s0)
   added: (at driver3 p2-0)
   changed: (walked) from 0 to 65
   goals met: 3 of 12
2. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 3 of 12
3. (walk driver3 p2-0 s2)
   deleted: (at driver3 p2-0)
   added: (at driver3 s2)
   changed: (walked) from 65 to 158
   goals met: 4 of 12
4. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 3 of 12
5. (load-truck package7 truck1 s2)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 3 of 12
6. (load-truck package8 truck1 s2)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 3 of 12
7. (drive-truck truck1 s2 s1 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 0 to 66
   goals met: 4 of 12
8. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 5 of 12
9. (unload-truck package7 truck1 s1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 6 of 12
10. (load-truck package4 truck1 s1)
   deleted: (at package4 s1)
   added: (in package4 truck1)
   goals met: 6 of 12
11. (load-truck package6 truck1 s1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   goals met: 6 of 12
12. (drive-truck truck1 s1 s2 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 66 to 132
   goals met: 5 of 12
13. (unload-truck package4 truck1 s2)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 6 of 12
14. (drive-truck truck1 s2 s0 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 132 to 192
   goals met: 6 of 12
15. (unload-truck package8 truck1 s0)
   deleted: (in package8 truck1)
   added: (at package8 s0)
   goals met: 7 of 12
16. (load-truck package5 truck1 s0)
   deleted: (at package5 s0)
   added: (in package5 truck1)
   goals met: 7 of 12
17. (drive-truck truck1 s0 s2 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 192 to 252
   goals met: 7 of 12
18. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 8 of 12
19. (unload-truck package6 truck1 s2)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 8 of 12
20. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 7 of 12
21. (load-truck package6 truck2 s2)
   deleted: (at package6 s2)
   added: (in package6 truck2)
   goals met: 7 of 12
22. (drive-truck truck2 s2 s0 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 252 to 312
   goals met: 6 of 12
23. (walk driver1 s0 p2-0)
   deleted: (at driver1 s0)
   added: (at driver1 p2-0)
   changed: (walked) from 158 to 223
   goals met: 6 of 12
24. (unload-truck package5 truck1 s2)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   goals met: 7 of 12
25. (unload-truck package6 truck2 s0)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   goals met: 8 of 12
26. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 312 to 372
   goals met: 9 of 12
27. (walk driver1 p2-0 s2)
   deleted: (at driver1 p2-0)
   added: (at driver1 s2)
   changed: (walked) from 223 to 316
   goals met: 9 of 12
28. (walk driver4 s1 p1-2)
   deleted: (at driver4 s1)
   added: (at driver4 p1-2)
   changed: (walked) from 316 to 406
   goals met: 9 of 12
29. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 9 of 12
30. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 10 of 12
31. (walk driver4 p1-2 s2)
   deleted: (at driver4 p1-2)
   added: (at driver4 s2)
   changed: (walked) from 406 to 500
   goals met: 11 of 12
32. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 372 to 438
   goals met: 12 of 12
